JihedChaibi/STM32F4xx-HAL/stm32f401xx_SPI_drivers.c
/*
 * stm32f401xx_SPI_drivers.c
 *
 *  Created on: Jun 9, 2020
 *      Author: hs
 */


#include "stm32f401xx_SPI_drivers.h"

static void  spi_txe_interrupt_handle(SPI_Handle_t *pSPIHandle);
static void  spi_rxne_interrupt_handle(SPI_Handle_t *pSPIHandle);
static void  spi_ovr_err_interrupt_handle(SPI_Handle_t *pSPIHandle);


/**********************************************************************************************************
 * 				                           SUPPORTED APIs
 *         			          Check Functions Definitions For More Info
**********************************************************************************************************/



/*********************************************************************
 * @fn      		  - SPI_Control
 *
 * @brief             - This function enables or disables the SPIx Peripheral
 *
 * @param[in]         - base address of the SPI peripheral
 * @param[in]         - ENABLE or DISABLE macros
 * @param[in]         -
 *
 * @return            -  none
 *
 * @Note              -  none
 */

void SPI_Control(SPI_RegDef_t* pSPI, uint8_t ENA_DIS){

	if (ENA_DIS == ENABLE)
	{
		pSPI->CR1 |= (1 << SPI_CR1_SPE);
	}else
	{
		pSPI->CR1 &= ~(1 << SPI_CR1_SPE);
	}
}

/*********************************************************************
 * @fn      		  - SPI_CLKControl
 *
 * @brief             - This function enables or disables peripheral clock for SPI
 *
 * @param[in]         - base address of the SPI peripheral
 * @param[in]         - ENABLE or DISABLE macros
 * @param[in]         -
 *
 * @return            -  none
 *
 * @Note              -  none
 */
void SPI_CLKControl(SPI_RegDef_t* pSPIx, uint8_t ENA_DIS){



	if(ENA_DIS == ENABLE)
	{
		if(pSPIx == SPI1)
		{
			SPI1_CLK_EN();
		}else if (pSPIx == SPI2)
		{
			SPI2_CLK_EN();
		}else if (pSPIx == SPI3)
		{
			SPI3_CLK_EN();
		}
		else if (pSPIx == SPI4)
		{
		     SPI4_CLK_EN();
		}
	}
	else
	{
		if(pSPIx == SPI1)
		{
			SPI1_CLK_DI();
		}else if (pSPIx == SPI2)
		{
			SPI2_CLK_DI();
		}else if (pSPIx == SPI3)
		{
			SPI3_CLK_DI();
		}
		else if (pSPIx == SPI4)
		{
			SPI4_CLK_DI();
		}

	}

}



/*********************************************************************
 * @fn      		  - SPI_Init
 *
 * @brief             - This function initialize the SOI peripheral
 *
 * @param[in]         - base address of the SPI handler
 * @param[in]         -
 *
 * @return            -  none
 *
 * @Note              -  none
 */
void SPI_Init(SPI_Handle_t *pSPIHandler){

	// SPI_CR1 Register Config

	uint32_t temp_reg = 0;

	// 1. Device mode
	temp_reg |= pSPIHandler->SPIConfig.SPI_DeviceMode << SPI_CR1_MSTR;

	// 2. Bus config
    if (pSPIHandler->SPIConfig.SPI_BusConfig == SPI_BUS_CONFIG_FD)
    {
    	temp_reg &= ~(1 << SPI_CR1_BIDIMODE);
    }
    else if (pSPIHandler->SPIConfig.SPI_BusConfig == SPI_BUS_CONFIG_HD)
    {
    	temp_reg |= (1 << SPI_CR1_BIDIMODE);

    }else if (pSPIHandler->SPIConfig.SPI_BusConfig == SPI_BUS_CONFIG_SIMPLEX_RXONLY)
    {
    	temp_reg &= ~(1 << SPI_CR1_BIDIMODE);
    	temp_reg |= (1 << SPI_CR1_RXONLY);
    }

	// 3. Bus config
    temp_reg |= pSPIHandler->SPIConfig.SPI_SclkSpeed << SPI_CR1_BR;

    // 4. Data frame config
    temp_reg |= pSPIHandler->SPIConfig.SPI_DFF << SPI_CR1_DFF;

    // 5. Software slave management config
    temp_reg |= pSPIHandler->SPIConfig.SPI_SSM << SPI_CR1_SSM;


    // 6. Internal slave select
    temp_reg |= pSPIHandler->SPIConfig.SPI_SSI << SPI_CR1_SSI;

    // 7. CPOL: Clock polarity
    temp_reg |= pSPIHandler->SPIConfig.SPI_CPOL << SPI_CR1_CPOL;

    // 8. CPHA: Clock phase
    temp_reg |= pSPIHandler->SPIConfig.SPI_CPHA << SPI_CR1_CPHA;


    pSPIHandler->pSPIx->CR1 = temp_reg;

}

/*********************************************************************
 * @fn      		  - SPI_DeInit
 *
 * @brief             - This function de-initialize the SPI
 *                      to its reset values
 *
 * @param[in]         - base address of the SPI peripheral handler
 * @param[in]         -
 *
 * @return            -  none
 *
 * @Note              -  none
 */
void SPI_DeInit(SPI_RegDef_t *pSPI){



	if 		(pSPI == SPI1) SPI1_REG_RESET();
	else if (pSPI == SPI2) SPI2_REG_RESET();
	else if (pSPI == SPI3) SPI3_REG_RESET();
	else if (pSPI == SPI4) SPI4_REG_RESET();

}





/*********************************************************************
 * @fn      		  - SPI_GetFlagStatus
 *
 * @brief             - Get SPI status flag
 *
 * @param[in]         - base address of the SPI peripheral handler
 * @param[in]         - Flag name
 *
 *
 * @return            -  Flag status : FLAG_RESET / FLAG_SET
 *
 * @Note              -  none
 */


uint8_t SPI_GetFlagStatus(SPI_RegDef_t *pSPIx , uint32_t FlagName)
{
	if(pSPIx->SR & FlagName)
	{
		return FLAG_SET;
	}
	return FLAG_RESET;
}


/*********************************************************************
 * @fn      		  - SPI_SendData
 *
 * @brief             - Send data through SPI
 *
 * @param[in]         - base address of the SPI peripheral handler
 * @param[in]         - pointer to data buffer
 * @param[in]         - length of data to send
 *
 *
 * @return            -  none
 *
 * @Note              -  Blocking call (Polling)
 */
void SPI_SendData(SPI_RegDef_t *pSPIx,uint8_t *pTxBuffer, uint32_t Len){

	while(Len > 0)
	{

	  // if TX Buffer not empty.. wait
      while(SPI_GetFlagStatus(pSPIx,SPI_TXE_FLAG) == FLAG_RESET );

      if( (pSPIx->CR1 & (1 << SPI_CR1_DFF)) == SPI_DFF_16BITS)
      {
    	  //16 bits data
    	  pSPIx->DR=*((uint16_t *)pTxBuffer);
    	  Len--;
    	  Len--;
    	  (uint16_t *)pTxBuffer++;
      }
      else
      {
    	  //8 bits data
    	  pSPIx->DR=*pTxBuffer;
    	  Len--;
    	  pTxBuffer++;
      }


	}


}


/*********************************************************************
 * @fn      		  - SPI_ReceiveData
 *
 * @brief             - Receive data from SPI
 *
 * @param[in]         - base address of the SPI peripheral handler
 * @param[in]         - pointer to data buffer
 * @param[in]         - length of data to read
 *
 *
 * @return            -  none
 *
 * @Note              -  none
 */
void SPI_ReceiveData(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t Len){


	while(Len > 0)
	{

	  // if TX Buffer not empty.. wait
      while(SPI_GetFlagStatus(pSPIx,SPI_RXNE_FLAG) == FLAG_RESET );

      if( (pSPIx->CR1 & (1 << SPI_CR1_DFF)) == SPI_DFF_16BITS)
      {
    	  //16 bits data
    	  *((uint16_t *)pRxBuffer)= pSPIx->DR;
    	  Len--;
    	  Len--;
    	  (uint16_t *)pRxBuffer++;
      }
      else
      {
    	  //8 bits data
    	  *(pRxBuffer) = pSPIx->DR;
    	  Len--;
    	  pRxBuffer++;
      }

	}


}





/*********************************************************************
 * @fn      		  - SPI_IRQInterruptConfig
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              -
 */
void SPI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{

	if(EnorDi == ENABLE)
	{
		if(IRQNumber <= 31)
		{
			//program ISER0 register
			*NVIC_ISER0 |= ( 1 << IRQNumber );

		}else if(IRQNumber > 31 && IRQNumber < 64 ) //32 to 63
		{
			//program ISER1 register
			*NVIC_ISER1 |= ( 1 << (IRQNumber % 32) );
		}
		else if(IRQNumber >= 64 && IRQNumber < 96 )
		{
			//program ISER2 register //64 to 95
			*NVIC_ISER3 |= ( 1 << (IRQNumber % 64) );
		}
	}else
	{
		if(IRQNumber <= 31)
		{
			//program ICER0 register
			*NVIC_ICER0 |= ( 1 << IRQNumber );
		}else if(IRQNumber > 31 && IRQNumber < 64 )
		{
			//program ICER1 register
			*NVIC_ICER1 |= ( 1 << (IRQNumber % 32) );
		}
		else if(IRQNumber >= 6 && IRQNumber < 96 )
		{
			//program ICER2 register
			*NVIC_ICER3 |= ( 1 << (IRQNumber % 64) );
		}
	}

}


/*********************************************************************
 * @fn      		  - SPI_IRQPriorityConfig
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              -
 */
void SPI_IRQPriorityConfig(uint8_t IRQNumber,uint32_t IRQPriority)
{
	//1. first lets find out the ipr register
	uint8_t iprx = IRQNumber / 4;
	uint8_t iprx_section  = IRQNumber %4 ;

	uint8_t shift_amount = ( 8 * iprx_section) + ( 8 - NO_PR_BITS_IMPLEMENTED) ;

	*(  NVIC_PR_BASE_ADDR + iprx ) |=  ( IRQPriority << shift_amount );

}




uint8_t SPI_SendDataIT(SPI_Handle_t *pSPIHandle,uint8_t *pTxBuffer, uint32_t Len)
{
	uint8_t state = pSPIHandle->TxState;

	if(state != SPI_BUSY_IN_TX)
	{
		//1 . Save the Tx buffer address and Len information in some global variables
		pSPIHandle->pTxBuffer = pTxBuffer;
		pSPIHandle->TxLen = Len;
		//2.  Mark the SPI state as busy in transmission so that
		//    no other code can take over same SPI peripheral until transmission is over
		pSPIHandle->TxState = SPI_BUSY_IN_TX;

		//3. Enable the TXEIE control bit to get interrupt whenever TXE flag is set in SR
		pSPIHandle->pSPIx->CR2 |= ( 1 << SPI_CR2_TXEIE );

	}


	return state;
}


uint8_t SPI_ReceiveDataIT(SPI_Handle_t *pSPIHandle, uint8_t *pRxBuffer, uint32_t Len)
{
	uint8_t state = pSPIHandle->RxState;

	if(state != SPI_BUSY_IN_RX)
	{
		//1 . Save the Rx buffer address and Len information in some global variables
		pSPIHandle->pRxBuffer = pRxBuffer;
		pSPIHandle->RxLen = Len;
		//2.  Mark the SPI state as busy in reception so that
		//    no other code can take over same SPI peripheral until reception is over
		pSPIHandle->RxState = SPI_BUSY_IN_RX;

		//3. Enable the RXNEIE control bit to get interrupt whenever RXNEIE flag is set in SR
		pSPIHandle->pSPIx->CR2 |= ( 1 << SPI_CR2_RXNEIE );

	}


	return state;

}





void SPI_IRQHandling(SPI_Handle_t *pHandle)
{

	//WHAT FLAG SENT THE INTERRUPT????

	uint8_t temp1 , temp2;
	//first lets check for TXE
	temp1 = pHandle->pSPIx->SR & ( 1 << SPI_SR_TXE);
	temp2 = pHandle->pSPIx->CR2 & ( 1 << SPI_CR2_TXEIE);

	if( temp1 && temp2)
	{
		//handle TXE
		spi_txe_interrupt_handle(pHandle);
	}

	// check for RXNE
	temp1 = pHandle->pSPIx->SR & ( 1 << SPI_SR_RXNE);
	temp2 = pHandle->pSPIx->CR2 & ( 1 << SPI_CR2_RXNEIE);

	if( temp1 && temp2)
	{
		//handle RXNE
		spi_rxne_interrupt_handle(pHandle);
	}

	// check for ovr flag
	temp1 = pHandle->pSPIx->SR & ( 1 << SPI_SR_OVR);
	temp2 = pHandle->pSPIx->CR2 & ( 1 << SPI_CR2_ERRIE);

	if( temp1 && temp2)
	{
		//handle ovr error
		spi_ovr_err_interrupt_handle(pHandle);
	}


}


//some helper function implementations

static void  spi_txe_interrupt_handle(SPI_Handle_t *pSPIHandle)
{
	// check the DFF bit in CR1
	if( (pSPIHandle->pSPIx->CR1 & ( 1 << SPI_CR1_DFF) ) )
	{
		//16 bit DFF
		//1. load the data in to the DR
		pSPIHandle->pSPIx->DR =   *((uint16_t*)pSPIHandle->pTxBuffer);
		pSPIHandle->TxLen--;
		pSPIHandle->TxLen--;
		(uint16_t*)pSPIHandle->pTxBuffer++;
	}else
	{
		//8 bit DFF
		pSPIHandle->pSPIx->DR =   *pSPIHandle->pTxBuffer;
		pSPIHandle->TxLen--;
		pSPIHandle->pTxBuffer++;
	}

	if(! pSPIHandle->TxLen)
	{
		//TxLen is zero , so close the spi transmission and inform the application that
		//TX is over.

		//this prevents interrupts from setting up of TXE flag
		SPI_CloseTransmisson(pSPIHandle);
		SPI_ApplicationEventCallback(pSPIHandle,SPI_EVENT_TX_CMPLT);
	}

}


static void  spi_rxne_interrupt_handle(SPI_Handle_t *pSPIHandle)
{
	//do rxing as per the dff
	if(pSPIHandle->pSPIx->CR1 & ( 1 << 11))
	{
		//16 bit
		*((uint16_t*)pSPIHandle->pRxBuffer) = (uint16_t) pSPIHandle->pSPIx->DR;
		pSPIHandle->RxLen -= 2;
		pSPIHandle->pRxBuffer++;
		pSPIHandle->pRxBuffer++;

	}else
	{
		//8 bit
		*(pSPIHandle->pRxBuffer) = (uint8_t) pSPIHandle->pSPIx->DR;
		pSPIHandle->RxLen--;
		pSPIHandle->pRxBuffer++;
	}

	if(! pSPIHandle->RxLen)
	{
		//reception is complete
		SPI_CloseReception(pSPIHandle);
		SPI_ApplicationEventCallback(pSPIHandle,SPI_EVENT_RX_CMPLT);
	}

}


static void  spi_ovr_err_interrupt_handle(SPI_Handle_t *pSPIHandle)
{

	uint8_t temp;
	//1. clear the ovr flag
	if(pSPIHandle->TxState != SPI_BUSY_IN_TX)
	{
		temp = pSPIHandle->pSPIx->DR;
		temp = pSPIHandle->pSPIx->SR;
	}
	(void)temp;
	//2. inform the application
	SPI_ApplicationEventCallback(pSPIHandle,SPI_EVENT_OVR_ERR);

}


void SPI_CloseTransmisson(SPI_Handle_t *pSPIHandle)
{
	pSPIHandle->pSPIx->CR2 &= ~( 1 << SPI_CR2_TXEIE);
	pSPIHandle->pTxBuffer = NULL;
	pSPIHandle->TxLen = 0;
	pSPIHandle->TxState = SPI_READY;

}

void SPI_CloseReception(SPI_Handle_t *pSPIHandle)
{
	pSPIHandle->pSPIx->CR2 &= ~( 1 << SPI_CR2_RXNEIE);
	pSPIHandle->pRxBuffer = NULL;
	pSPIHandle->RxLen = 0;
	pSPIHandle->RxState = SPI_READY;

}



void SPI_ClearOVRFlag(SPI_RegDef_t *pSPIx)
{
	uint8_t temp;
	temp = pSPIx->DR;
	temp = pSPIx->SR;
	(void)temp;

}



__weak void SPI_ApplicationEventCallback(SPI_Handle_t *pSPIHandle,uint8_t AppEv)
{

	//This is a weak implementation . the user application may override this function.
}


